# pytest llm_test.py -v -s
import os
from dotenv import load_dotenv
load_dotenv(override=True)
groq_api_key = os.getenv("CHATGROQ_API_KEY")
os.environ['HF_HOME'] = './.cache/huggingface'
os.environ['HF_HUB_DISABLE_SYMLINKS_WARNING'] = '1'

import nbimporter
import pytest
import main
from langchain_groq import ChatGroq

embedding, db = main.db_connection("intfloat/multilingual-e5-large-instruct", "test_db/chroma3")

EVAL_PROMPT = """
Expected Response: {expected_response}
Actual Response: {actual_response}
---
---
Оціни, чи передає Actual Response той самий зміст, що й Expected Response, за такими правилами:

1. Перед порівнянням повністю ігноруй HTML-теги (<b>, </b>, <i>, </i>, тощо), Markdown-символи (**, *, _, #) та інші символи форматування.
2. Ігноруй різницю у великих/малих літерах та зайві пробіли/переноси рядків.
3. Якщо у Actual Response є лише додаткові службові слова (наприклад, "Python — це ..."), але сенс відповіді збігається — вважай відповідь правильною 'true'.
4. Тільки якщо відповіді явно мають однаковий сенс, виводьте лише 'true'.
5. Якщо в одній з відповідей трохи більше інформації, проте сенс збігається, виводьте 'true'
6. Якщо у відповідях є дати, числа чи інші кількісні значення — вони повинні збігатися абсолютно точно. Дозволяється лише еквівалентний запис (наприклад, замість "3" написано "1 + 2"), тоді відповідь теж рахується правильною 'true, в інших випадках відповідь неправильна 'false'.
7. Якщо сенс відповіді навіть трохи не збігається — вважай відповідь неправильною 'false'.
8. Якщо відповіді в наданих документах немає, то відповідь неправильною 'false'.
9. Якщо в одній з відповідей є списки, то треба порівнювати сенс цих списків, якщо сенс збігається, то відповідь 'true'.
10. Не припускайте прихованих зв'язків, метафор чи альтернативних інтерпретацій.
11. Відповідай 'true' або 'false'. Обов'язково в кінці відповіді повинен бути результат 'true' або 'false'.
"""

# Відповідь тільки одне слово 'true' або 'false'


@pytest.mark.parametrize("question,expected_response", [
    ("Яка тривалість семестру та екзаменаційної сесії?", "15 навчальних тижнів плюс 2 тижні екзаменаційної сесії."),
    ("Коли можна змінити ІНП? ","Протягом перших 10 календарних днів семестру; пізніше - лише за наказом декана."),
    ("З чого формується підсумкова оцінка і який мінімум для допуску?", "ПО = 60% поточного контролю + 40% підсумкового; для допуску потрібно щонайменше 40 із 60 балів за ПК."),
    ("Скільки перескладань дозволено і в які строки?","Два: перше — в межах поточної сесії безкоштовно, друге — протягом 30 днів після сесії на платній основі."),
    ("Які основні вимоги до оформлення курсової?", "25–35 сторінок; Times New Roman 14; інтервал 1,5; поля 30/10/20/20 мм; нумерація з другої сторінки; посилання за ДСТУ 8302:2015."),
    ("Коли подавати курсову і що, якщо оригінальність <70%?","Подати не пізніше ніж за 7 днів до початку сесії; якщо <70%, роботу повертають на доопрацювання до 5 робочих днів."),
    ("Які документи потрібні для участі у мобільності?","Для участі студент подає заяву, копії академічної довідки та мотиваційний лист."),
    ("Які умови відбору на міжнародні програми?","Середній бал ≥75, рівень іноземної мови B2+, рекомендація куратора."),
    ("Які можливі дисциплінарні стягнення?","Зауваження, догана або відрахування."),
    ("Чи можна оскаржити дисциплінарне рішення?","Так, протягом 10 днів у комісії з етики."),

    ("Який термін користування підручником?","30 днів + можливість продовжити на 15."),
    ("Що робити у випадку втрати книги бібліотеки?","Відшкодувати вартість або замінити ідентичним виданням."),
    ("Які умови отримання академічної стипендії?","Відсутність академічних боргів і середній бал ≥70."),
    ("Чи можна отримувати одночасно академічну і соціальну стипендію?","Студенти можуть отримувати одночасно академічну і соціальну стипендію"),
    ("Що є обов’язковими документами студента під час практики?","Щоденник практики та письмовий звіт."),
    ("У яких випадках практика може бути перенесена?","За поважних причин (хвороба, сімейні обставини) і з дозволу декана."),
    ("Який мінімальний відсоток вибіркових дисциплін має бути в освітній програмі і що відбувається, якщо група не набрала 15 осіб?","Мінімум 25% програми; якщо менше 15 студентів, кафедра пропонує альтернативну дисципліну."),
    ("У яких випадках студент може змінити вибір дисципліни після завершення періоду реєстрації?","Лише у випадку відрахування або участі в академічній мобільності."),
    ("Які структурні елементи обов’язково повинна містити дипломна робота і який обсяг встановлений?","Вступ, огляд літератури, аналітична частина, дослідження, висновки, список джерел; обсяг 50–70 сторінок."),
    ("Коли студент має подати дипломну роботу і хто входить до складу комісії на захисті?","Не пізніше ніж за 14 днів до атестації; комісія — мінімум 5 членів, голова з іншої установи."),

    ("Які основні види академічних порушень перелічені в документі?", "Плагіат, самоплагіат, фабрикація, фальсифікація, списування, стороння допомога, необґрунтоване співавторство."),
    ("Хто приймає рішення про дисциплінарні заходи та які можливі санкції передбачені?", "Комісія з академічної доброчесності; санкції — від попередження до відрахування."),
    ("Які документи потрібні для заселення і на який строк укладається договір?", "Заява, студентський квиток, паспорт, квитанція про оплату; договір укладається на 1 навчальний рік."),
    ("Які правила проживання у гуртожитку та які наслідки їх порушення?", "Тиша 22:00–7:00, заборона алкоголю, куріння, тварин, сторонніх осіб без дозволу; санкції — попередження, штраф, виселення."),
    ("У які строки публікується розклад занять і хто його затверджує?", "Не пізніше ніж за 10 днів до семестру; затверджує проректор з навчальної роботи."),
    ("Які умови встановлені для початку та завершення занять протягом дня і які можливі перерви?", "Заняття не раніше 8:00 і не пізніше 19:00; перерви 10 хв між парами і 20 хв після другої пари."),
    ("Які документи необхідно подати для отримання індивідуального графіка навчання?", "Заяву, підтвердні документи (довідка про роботу, медичний висновок тощо) та погодження куратора."),
    ("Чи може студент продовжити семестр у межах індивідуального графіка?", "Ні, він зобов’язаний виконати весь обсяг навчальної програми в межах поточного семестру."),
    ("У якій формі можуть бути опубліковані результати студентських досліджень?", "У вигляді тез, статей, презентацій у збірниках конференцій або наукових виданнях."),
    ("Які види заохочення передбачені для студентів, що активно займаються наукою?", "Додаткові бали (до 10%), премії, рекомендації для міжнародних програм."),

    ("Хто відповідає за справність обладнання і чи можуть студенти користуватися ним самостійно?", "Завідувач лабораторії або викладач; студенти можуть користуватися лише під наглядом викладача."),
    ("У яких випадках студент зобов’язаний відшкодувати збитки за техніку?", "Якщо доведено його вину в пошкодженні обладнання."),
    ("Яка мінімальна тривалість літніх канікул для випускників і чому вона скорочується?", "Не менше 4 тижнів, скорочуються через державну атестацію."),
    ("У яких випадках студент може залишатися в гуртожитку під час канікул?", "Якщо сплачує проживання."),
    ("Яка різниця між відвідуванням спортивних секцій та тренажерних залів?", "Секції безкоштовні та проводяться 2–3 рази на тиждень; тренажерні зали доступні лише за абонементами."),
    ("Які вимоги обов’язкові перед початком занять спортом?", "Медичний огляд у студентській поліклініці."),
    ("Які обмеження існують щодо використання корпоративної пошти студента?", "Заборонено спам, комерційна реклама та поширення шкідливого ПЗ."),
    ("Які вимоги встановлені до викладачів щодо публікації матеріалів у LMS?", "Вони мають розміщувати матеріали не пізніше ніж за 3 дні до першої лекції."),
    ("Які документи необхідні для відвідування занять фізичного виховання?", "Медична довідка про допуск."),
    ("Які наслідки можуть бути, якщо студент не пройшов щорічний медогляд?", "Його можуть не допустити до занять та практики."),

    ("Які кроки потрібно зробити студенту для оформлення академічної відпустки?", "Подати заяву, підтвердні документи та отримати погодження деканату."),
    ("Які наслідки настають, якщо студент не подав заяву на повернення вчасно?", "Він може бути відрахований."),
    ("Які документи може видати деканат студенту за запитом?", "Академічну довідку та довідку з місця навчання."),
    ("У який строк деканат розглядає скарги студентів?", "Протягом 10 робочих днів."),
    ("Які основні завдання виконує студентська рада факультету?", "Захист прав студентів, організація культурних заходів, співпраця з адміністрацією, участь у стипендіальному розподілі."),
    ("Які повноваження має рада у відносинах з вченою радою університету?", "Вона бере участь у засіданнях з правом дорадчого голосу."),
    ("Які документи необхідні для переведення студента в межах чи за межами університету?", "Заява на ім’я ректора та академічна довідка."),
    ("Які умови визначають, на який курс поновлюється студент після академічної різниці?", "Якщо різниця ≤10 кредитів ECTS — поновлення на той самий курс, якщо більше — на попередній."),
    ("Які умови обов’язкові для допуску студента до державної атестації?", "Виконання всіх вимог навчального плану, відсутність академічної та фінансової заборгованості."),
    ("Хто входить до складу ДЕК і який строк публікації розкладу атестації?", "Викладачі профільних кафедр і голова з іншого закладу; розклад публікується мінімум за місяць до початку."),

])
def test_answers(question, expected_response):
    assert query_and_validate(
        question=question,
        expected_response=expected_response,
        is_fake=False,
    )

@pytest.mark.parametrize("question,expected_response", [
    ("Коли проводиться тиждень самостійної роботи?", "У кінці семестру, після екзаменаційної сесії."),
    ("До якого числа публікують календар навчального року?", "До 1 вересня на сайті університету."),
    ("Яка мінімальна підсумкова оцінка потрібна для складання курсу?", "Достатньо набрати 50 балів."),
    ("У який строк можна подати апеляцію на результати?", "Протягом 10 робочих днів після завершення сесії."),
    ("Як часто перевіряють успішність для призначення академічної стипендії?", "Один раз на рік — у червні після літньої сесії."),
    ("Коли припиняються виплати соціальної стипендії після втрати підстав?", "Виплати зупиняють одразу після ухвалення рішення деканатом."),
    ("Який мінімальний рівень оригінальності дипломної роботи допускається?", "Достатньо 60% за результатами перевірки."),
    ("Коли має бути затверджена тема дипломної роботи?", "У другому семестрі останнього навчального року."),
    ("У який строк студент може подати апеляцію на рішення комісії стосовно академічної доброчесності?", "Протягом 10 робочих днів після оголошення рішення."),
    ("Як часто університет проводить тренінги з академічної доброчесності?", "Двічі на рік — на початку кожного семестру."),
])
def test_fake_answers(question, expected_response):
    assert query_and_validate(
        question=question,
        expected_response=expected_response,
        is_fake=True,
    )



def query_and_validate(question: str, expected_response: str, is_fake: bool):
    response_text = main.test_llm(question, db, groq_api_key)
    prompt = EVAL_PROMPT.format(
        expected_response=expected_response, actual_response=response_text
    )

    model = ChatGroq(temperature=0,
                        model_name="meta-llama/llama-4-scout-17b-16e-instruct", #llama-3.1-8b-instant, qwen/qwen3-32b, openai/gpt-oss-20b, meta-llama/llama-4-maverick-17b-128e-instruct, meta-llama/llama-4-scout-17b-16e-instruct
                        api_key=groq_api_key)
    evaluation_results_str = model.invoke(prompt)
    # print(evaluation_results_str)
    evaluation_results_str_cleaned = evaluation_results_str.content.strip().lower()

    print(prompt)

    if "true" in evaluation_results_str_cleaned:
        if is_fake:
            print("\033[91m" + f"Response: {evaluation_results_str_cleaned}" + "\033[0m")
            return False
        # Print response in Green if it is correct.
        print("\033[92m" + f"Response: {evaluation_results_str_cleaned}" + "\033[0m")
        return True
    elif "false" in evaluation_results_str_cleaned:
        if is_fake:
            print("\033[92m" + f"Response: {evaluation_results_str_cleaned}" + "\033[0m")
            return True
        # Print response in Red if it is incorrect.
        print("\033[91m" + f"Response: {evaluation_results_str_cleaned}" + "\033[0m")
        return False
    else:
        raise ValueError(
            f"Invalid evaluation result. Cannot determine if 'true' or 'false'."
        )